**feature engineering**

- so far we have peroform feature analysis
- that includes dataframe quick checks
- categorical analysis
    - bar charts
    - pie charts
- numerical column analysis
    - histogram
    - boxplot
    - outliers
    - scatter
- bi-multivariate analysis
- correlation etc
- now we need to learn feature engineering
    - we will create new columns for better ML models
    - we will perform the Encoding,Which convert cat data to num data
    - we will do transformation
    - we will perform scaling : Standardization and Normalization
    - we will perform missing value analysis
- simply feature engineering means our data will be modify

feature analysis
feature engineering
feature selection 
model developement
model evaluation
model tuning
model deployment

**Encoding**
- encoding means changing cat data to num data
- ML doesnt understand english char so
- it is very important to convert the categorical labels to numerical data
- for example we have two columns
    - Male
    - Female
- Male represent 1
- Female represent 0
- based on alphabetical orders

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
path = r"D:\data-files\Visadataset.csv"
visadf = pd.read_csv(path)
num = visadf.select_dtypes(exclude='object').columns
cat = visadf.select_dtypes(include='object').columns

In [3]:
cat,num

(Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
        'requires_job_training', 'region_of_employment', 'unit_of_wage',
        'full_time_position', 'case_status'],
       dtype='object'),
 Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object'))

In [4]:
case_status = visadf['case_status'].unique()
case_status

array(['Denied', 'Certified'], dtype=object)

- Cerified should assign as 0 
- Denied should assigned as 1

In [5]:
d = {'Certified':0,
    'Denied':1} #this called mapping
d

{'Certified': 0, 'Denied': 1}

In [6]:
mapped = visadf['case_status'].map(d)
mapped

0        1
1        0
2        1
3        1
4        0
        ..
25475    0
25476    0
25477    0
25478    0
25479    0
Name: case_status, Length: 25480, dtype: int64

In [7]:
visadf['case_status']=mapped
visadf['case_status']

0        1
1        0
2        1
3        1
4        0
        ..
25475    0
25476    0
25477    0
25478    0
25479    0
Name: case_status, Length: 25480, dtype: int64

In [8]:
visadf['continent'].unique()

array(['Asia', 'Africa', 'North America', 'Europe', 'South America',
       'Oceania'], dtype=object)

In [9]:
d1 = {
    'Asia':0,
    'Africa':1,
    'North America':3,
    'Europe':2,
    'South America':5,
    'Ocenia':4
    
}
d1

{'Asia': 0,
 'Africa': 1,
 'North America': 3,
 'Europe': 2,
 'South America': 5,
 'Ocenia': 4}

In [10]:
labels = visadf['continent'].unique()
n = len(labels)
d1 = {}
for i,j in zip(labels,range(n)):
    d1[i]=j
d1

{'Asia': 0,
 'Africa': 1,
 'North America': 2,
 'Europe': 3,
 'South America': 4,
 'Oceania': 5}

In [11]:
cont_mapped = visadf['continent'].map(d1)
visadf['continent']=cont_mapped
visadf['continent']

0        0
1        0
2        0
3        0
4        1
        ..
25475    0
25476    0
25477    0
25478    0
25479    0
Name: continent, Length: 25480, dtype: int64

In [12]:
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,0,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,0,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,0,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,0,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,1,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,0,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,0,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,0,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,0,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,0,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [25]:
#Another method
for i in cat[1:]:
    labels = sorted(visadf[i].unique())
    d = {j:i for i,j in enumerate(labels)}
    mapped = visadf[i]=visadf[i].map(d)
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,0,2,0,0,14513,2007,4,592.2029,0,1,1
1,EZYV02,0,3,1,0,2412,2002,2,83425.6500,3,1,0
2,EZYV03,0,0,0,1,44444,2008,4,122996.8600,3,1,1
3,EZYV04,0,0,0,0,98,1897,4,83434.0300,3,1,1
4,EZYV05,1,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,0,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,EZYV25477,0,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,EZYV25478,0,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,EZYV25479,0,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,EZYV25480,0,0,1,0,3195,1960,1,70876.9100,3,1,0

**Label Encoder**
- LabelEncoder is a method will convert cat labels into num values
- it is under package **sklearn (scikit learn)**
    - The class name **preprocessing**
    - the method name **LabelEncoder**

In [26]:
from sklearn.preprocessing import LabelEncoder as encoder

- Step 1 import the method
- Step 2 save the method
- apply fit transform
- **fit transform**
    - fit means find the logic
        - in above example fit means create mapper or dict 
    - transform means apply the logic and change the data
        - apply the mapper on the data

In [29]:
visadf = pd.read_csv(path)
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [37]:
#stp 1 import method
from sklearn.preprocessing import LabelEncoder 
#stp2 save method
le = LabelEncoder()
#stp 3 
visadf['case_status']=le.fit_transform(visadf['case_status'])
visadf['continent'] = le.fit_transform(visadf['case_status'])

In [38]:
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,0,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,1,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,1,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,0,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,0,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,0,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,0,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,0,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,0,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [44]:
visadf = pd.read_csv(path)
cat = visadf.select_dtypes(include='object').columns

In [46]:
for i in cat[1:]:
    visadf[i]=le.fit_transform(visadf[i])
visadf

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,0

**One Hot Encoder**

- First how many column are there in a column
- That many new columns will created extra
- far ex case status has two labels
    - Certified
    - Denied
- So it will create two extra new column
    - case_status_Certified
    - case_status_Denied
- At a time one column value becomes 1 other columns value becomes 0
- This means a **One Hot Encoder**

#for ex
|case_status|case_status_Certified|case_status_Denied
|-|-|-|
Certified|1|0|
Denied|0|1

In [47]:
#continent C_A  C_A  C_E
#Asia       1    0    0
#Africa     0    1    0
#Europe     0    0    1

**pd.get_dummies**

In [48]:
visadf = pd.read_csv(path)
cat = visadf.select_dtypes(include='object').columns

In [50]:
pd.get_dummies(visadf['case_status'],dtype=int)

       Certified  Denied
0              0       1
1              1       0
2              0       1
3              0       1
4              1       0
...          ...     ...
25475          1       0
25476          1       0
25477          1       0
25478          1       0
25479          1       0

[25480 rows x 2 columns]

In [52]:
pd.get_dummies(visadf['continent'],dtype=int)

       Africa  Asia  Europe  North America  Oceania  South America
0           0     1       0              0        0              0
1           0     1       0              0        0              0
2           0     1       0              0        0              0
3           0     1       0              0        0              0
4           1     0       0              0        0              0
...       ...   ...     ...            ...      ...            ...
25475       0     1       0              0        0              0
25476       0     1       0              0        0              0
25477       0     1       0              0        0              0
25478       0     1       0              0        0              0
25479       0     1       0              0        0              0

[25480 rows x 6 columns]